---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
source: html/9921ffa2-625b-f5f6-c950-83d1abd67737.htm
---
# AssetPropertyDoubleArray3d Methods

Adds a new connected asset attached to this asset property, if it allows it.